In [31]:
import pandas as pd

In [32]:
df = pd.read_csv('orders.csv')

In [33]:
df

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian
...,...,...,...,...,...,...
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian
9996,9997,2867,267,06-08-2023,1188.05,Darbar Cafe Punjabi
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian
9999,10000,457,439,21-10-2023,879.58,Classic Cafe Family Restaurant

In [34]:
df1 = pd.read_json('users.json')

In [35]:
df1

      user_id       name       city membership
0           1     User_1    Chennai    Regular
1           2     User_2       Pune       Gold
2           3     User_3  Bangalore       Gold
3           4     User_4  Bangalore    Regular
4           5     User_5       Pune       Gold
...       ...        ...        ...        ...
2995     2996  User_2996  Hyderabad       Gold
2996     2997  User_2997  Hyderabad    Regular
2997     2998  User_2998  Bangalore    Regular
2998     2999  User_2999       Pune    Regular
2999     3000  User_3000  Hyderabad       Gold

[3000 rows x 4 columns]

In [36]:
df3 = pd.read_csv('restaurants.csv')

In [37]:
df3

     restaurant_id restaurant_name  cuisine  rating
0                1    Restaurant_1  Chinese     4.8
1                2    Restaurant_2   Indian     4.1
2                3    Restaurant_3  Mexican     4.3
3                4    Restaurant_4  Chinese     4.1
4                5    Restaurant_5  Chinese     4.8
..             ...             ...      ...     ...
495            496  Restaurant_496   Indian     3.1
496            497  Restaurant_497  Mexican     4.4
497            498  Restaurant_498  Chinese     3.9
498            499  Restaurant_499  Mexican     4.9
499            500  Restaurant_500  Chinese     3.2

[500 rows x 4 columns]

In [38]:
df3.shape

(500, 4)

In [39]:
merged_df = df.merge(
    df1,
    on="user_id",
    how="left"
)

In [40]:
merged_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular

In [42]:
print(type(merged_df))

<class 'pandas.core.frame.DataFrame'>

In [43]:
food_df = merged_df.merge(
    df3,
    on="restaurant_id",
    how="left"
)

In [44]:
food_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [46]:
food_df.to_csv("final_food_delvery_dataset.csv", index=False)

In [47]:
food_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   order_id           10000 non-null  int64
 1   user_id            10000 non-null  int64
 2   restaurant_id      10000 non-null  int64
 3   order_date         10000 non-null  object
 4   total_amount       10000 non-null  float64
 5   restaurant_name_x  10000 non-null  object
 6   name               10000 non-null  object
 7   city               10000 non-null  object
 8   membership         10000 non-null  object
 9   restaurant_name_y  10000 non-null  object
 10  cuisine            10000 non-null  object
 11  rating             10000 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 937.6+ KB

In [48]:
food_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [50]:
food_df[food_df["membership"] == "Gold"]

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
8,9,364,7,05-12-2023,953.30,Ruchi Biryani Punjabi,User_364,Chennai,Gold,Restaurant_7,Italian,3.2
11,12,884,423,27-10-2023,1484.65,Royal Tiffins Multicuisine,User_884,Pune,Gold,Restaurant_423,Indian,3.2
13,14,364,112,24-09-2023,898.24,Grand Cafe Punjabi,User_364,Chennai,Gold,Restaurant_112,Chinese,3.2
...,...,...,...,...,...,...,...,...,...,...,...,...
9993,9994,1616,198,28-04-2023,322.54,Annapurna Tiffins North Indian,User_1616,Hyderabad,Gold,Restaurant_198,Mexican,4.1
9994,9995,1257,328,12-11-2023,137.96,Ruchi Curry House Andhra,User_1257,Bangalore,Gold,Restaurant_328,Mexican,4.6
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold,Restaurant_249,Italian,4.7
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold,Restaurant_420,Italian,4.0
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold,Restaurant_492,Italian,4.0

In [51]:
gold_df = food_df[food_df["membership"] == "Gold"]

In [52]:
gold_df

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
8,9,364,7,05-12-2023,953.30,Ruchi Biryani Punjabi,User_364,Chennai,Gold,Restaurant_7,Italian,3.2
11,12,884,423,27-10-2023,1484.65,Royal Tiffins Multicuisine,User_884,Pune,Gold,Restaurant_423,Indian,3.2
13,14,364,112,24-09-2023,898.24,Grand Cafe Punjabi,User_364,Chennai,Gold,Restaurant_112,Chinese,3.2
...,...,...,...,...,...,...,...,...,...,...,...,...
9993,9994,1616,198,28-04-2023,322.54,Annapurna Tiffins North Indian,User_1616,Hyderabad,Gold,Restaurant_198,Mexican,4.1
9994,9995,1257,328,12-11-2023,137.96,Ruchi Curry House Andhra,User_1257,Bangalore,Gold,Restaurant_328,Mexican,4.6
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold,Restaurant_249,Italian,4.7
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold,Restaurant_420,Italian,4.0
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold,Restaurant_492,Italian,4.0

In [53]:
gold_city_revenue = gold_df.groupby("city")["total_amount"].sum()

In [54]:
gold_city_revenue.sort_values(ascending=False)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [56]:
food_df.groupby("cuisine")["total_amount"].mean() \
.sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [58]:
user_total = food_df.groupby("user_id")["total_amount"].sum()

In [59]:
count_users = user_total[user_total > 1000].count()
count_users

np.int64(2544)

In [61]:

restaurant_count = food_df.groupby('cuisine')['restaurant_id'].nunique()
restaurant_count

cuisine
Chinese    120
Indian     126
Italian    126
Mexican    128
Name: restaurant_id, dtype: int64

In [62]:

revenue_by_cuisine = food_df.groupby('cuisine')['total_amount'].sum()
revenue_by_cuisine

cuisine
Chinese    1930504.65
Indian     1971412.58
Italian    2024203.80
Mexican    2085503.09
Name: total_amount, dtype: float64

In [63]:
summary = pd.DataFrame({
    'distinct_restaurants': food_df.groupby('cuisine')['restaurant_id'].nunique(),
    'total_revenue': food_df.groupby('cuisine')['total_amount'].sum()
})
summary

         distinct_restaurants  total_revenue
cuisine
Chinese                   120     1930504.65
Indian                    126     1971412.58
Italian                   126     2024203.80
Mexican                   128     2085503.09

In [65]:
total_orders = food_df.shape[0]

In [66]:
gold_orders = food_df[food_df["membership"]=="Gold"].shape[0]

In [67]:
gold_percentage = round((gold_orders / total_orders) * 100)
gold_percentage

50

In [72]:
restaurant_summary = food_df.groupby('restaurant_name_x').agg(
    total_orders=('order_id','count'),
    avg_order_value=('total_amount','mean')
)

In [73]:
small_restaurants = restaurant_summary[restaurant_summary['total_orders'] < 20]

In [74]:
top_small_restaurant = small_restaurants['avg_order_value'].idxmax()
top_small_restaurant

'Hotel Dhaba Multicuisine'

In [76]:
food_df['combo'] = food_df['membership'] + " + " + food_df['cuisine']

In [78]:
combo_revenue = food_df.groupby('combo')['total_amount'].sum().sort_values()
combo_revenue

combo
Regular + Chinese     952790.91
Gold + Chinese        977713.74
Gold + Indian         979312.31
Regular + Indian      992100.27
Gold + Italian       1005779.05
Gold + Mexican       1012559.79
Regular + Italian    1018424.75
Regular + Mexican    1072943.30
Name: total_amount, dtype: float64

In [83]:
gold_orders_count = food_df[food_df['membership'] == "Gold"].shape[0]
gold_orders_count

4987

In [84]:
hyderabad_revenue = round(food_df[food_df['city'] == "Hyderabad"]['total_amount'].sum())
hyderabad_revenue

1889367

In [85]:
distinct_users = food_df['user_id'].nunique()
distinct_users

2883

In [87]:
gold_avg_order = round(food_df[food_df['membership'] == "Gold"]['total_amount'].mean(), 2)
gold_avg_order

np.float64(797.15)

In [89]:
high_rating_orders = food_df[food_df['rating'] >= 4.5].shape[0]
high_rating_orders

3374

In [91]:
# Filter Gold members
gold_df = food_df[food_df['membership'] == "Gold"]

# City-wise revenue
gold_city_revenue = gold_df.groupby('city')['total_amount'].sum()

# Top revenue city
top_city = gold_city_revenue.idxmax()

# Orders in that city
orders_in_top_city = gold_df[gold_df['city'] == top_city].shape[0]
orders_in_top_city

1337

In [93]:
food_df.tail()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating,combo
9995,9996,2528,249,2023-05-21,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold,Restaurant_249,Italian,4.7,Gold + Italian
9996,9997,2867,267,2023-08-06,1188.05,Darbar Cafe Punjabi,User_2867,Bangalore,Regular,Restaurant_267,Chinese,4.2,Regular + Chinese
9997,9998,522,420,2023-11-11,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold,Restaurant_420,Italian,4.0,Gold + Italian
9998,9999,319,492,2023-09-08,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold,Restaurant_492,Italian,4.0,Gold + Italian
9999,10000,457,439,2023-10-21,879.58,Classic Cafe Family Restaurant,User_457,Chennai,Regular,Restaurant_439,Mexican,3.1,Regular + Mexican